[
  {
    "country": "Albania",
    "city": "Tirana",
    "name": "Wojciech Unolt",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent filologii angielskiej na Uniwersytecie im. Adama Mickiewicza w Poznaniu. W latach 2008–2014 pełnił funkcję zastępcy kierownika placówki w Ambasadzie RP w Rzymie. Pracował w Ministerstwie Spraw Zagranicznych w Departamencie Strategii Polityki Zagranicznej oraz Departamencie Afryki i Bliskiego Wschodu. Od sierpnia 2018 do czerwca 2019 pełnił funkcję chargé d'affaires a.i. RP w Iranie, a następnie przez cztery lata był zastępcą kierownika tej placówki. Od stycznia 2025 r. kieruje placówką w Albanii."
  },
  {
    "country": "Algieria",
    "city": "Algier",
    "name": "Krzysztof Kopytko",
    "age": 51,
    "title": "chargé d'affaires a.i.",
    "bio": "Ukończył studia prawnicze na Uniwersytecie Jagiellońskim oraz podyplomowe studia z prawa UE (LL.M.) na Uniwersytecie Sztokholmskim. W latach 2005–2009 radca w Stałym Przedstawicielstwie RP przy UE. W latach 2013–2017 kierował Instytutem Polskim w Tel Awiwie. Funkcję w Algierii pełni od czerwca 2025 r. (z akredytacją w Czadzie i Nigrze)."
  },
  {
    "country": "Angola",
    "city": "Luanda",
    "name": "Robert Ambroziak",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Pełnił funkcję sekretarza Ambasady RP w Bośni i Hercegowinie. Kieruje placówką w Angoli od 2024 r."
  },
  {
    "country": "Arabia Saudyjska",
    "city": "Rijad",
    "name": "Robert Rostek",
    "age": 55,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Jagiellońskiego oraz Uniwersytetu w Damaszku. Pracował w Konsulacie Generalnym RP w Bengazi (1996), OBWE (1998), Ambasadzie RP w Egipcie (1999–2000), Ambasadzie RP w Syrii (2000–2004) oraz Ambasadzie RP w Kuwejcie (2003). W centrali MSZ pracował w Departamencie Afryki i Bliskiego Wschodu (1997, 2004, 2014–2015, 2021–2023). Pełnił funkcję Ambasadora RP w Katarze (2006–2013) oraz w Zjednoczonych Emiratach Arabskich (2016–2020). Stanowisko objął w 2023 r."
  },
  {
    "country": "Argentyna",
    "city": "Buenos Aires",
    "name": "Bogna Ruminowicz",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Była doradczyni ds. Praw Człowieka w ONZ. Funkcję kierownika placówki pełni od października 2024 r."
  },
  {
    "country": "Armenia",
    "city": "Erywań",
    "name": "Marcin Różycki",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Dyplomata, kieruje placówką od 2024 r."
  },
  {
    "country": "Australia",
    "city": "Canberra",
    "name": "Marcin Kawałowski",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Pracował jako zastępca stałego przedstawiciela RP przy Organizacji ds. Zakazu Broni Chemicznej (OPCW) w Hadze. Funkcję w Australii pełni od września 2023 r."
  },
  {
    "country": "Austria",
    "city": "Wiedeń",
    "name": "Zenon Kosiniak-Kamysz",
    "age": 67,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Technicznego w Dreźnie oraz studiów podyplomowych na Akademii Ekonomicznej w Krakowie. Pełnił funkcję podsekretarza stanu w Ministerstwie Spraw Wewnętrznych i Administracji (2001–2003) oraz w Ministerstwie Obrony Narodowej (2008–2009). Był Ambasadorem RP na Słowacji (2003–2007), w Kanadzie (2010–2013) oraz w Singapurze (2014–2018). Stanowisko w Austrii objął w lipcu 2025 r."
  },
  {
    "country": "Azerbejdżan",
    "city": "Baku",
    "name": "Paweł Radomski",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Jagiellońskiego oraz Krajowej Szkoły Administracji Publicznej. Pracował w Stałym Przedstawicielstwie RP przy NZ w Nowym Jorku (1998–2002) oraz w Ambasadzie RP w Waszyngtonie (2005–2010). W latach 2014–2020 zastępca szefa placówki w Stałym Przedstawicielstwie RP przy NZ w Nowym Jorku. Przed wyjazdem do Azerbejdżanu dyrektor Departamentu Spraw Globalnych w MSZ. Funkcję ambasadora pełni od czerwca 2025 r. (z akredytacją w Turkmenistanie)."
  },
  {
    "country": "Belgia",
    "city": "Bruksela",
    "name": "Katarzyna Skórzyńska",
    "age": 65,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka socjologii na Uniwersytecie Warszawskim oraz studiów podyplomowych w Szkole Głównej Handlowej. W centrali MSZ pracowała w Departamencie Stosunków Ekonomicznych (1996–1997) oraz Departamencie Zagranicznej Polityki Ekonomicznej (2006–2007). Pełniła funkcję podsekretarza stanu w Urzędzie Komitetu Integracji Europejskiej (2000–2001) oraz dyrektora Polskiego Instytutu Dyplomacji (2012–2016). Była Ambasadorem RP w Brazylii (1992–1996) i Portugalii (2007–2012). Placówką w Belgii kieruje od grudnia 2024 r."
  },
  {
    "country": "Białoruś",
    "city": "Mińsk",
    "name": "Krzysztof Ożanna",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Funkcję pełni od stycznia 2024 r."
  },
  {
    "country": "Biuro Polskie w Tajpej",
    "city": "Tajpej",
    "name": "Janusz Bilski",
    "age": 47,
    "title": "Dyrektor Biura Polskiego",
    "bio": "Ukończył stosunki międzynarodowe na Uniwersytecie Pekińskim oraz neofilologię na Uniwersytecie Warszawskim. W latach 2007–2010 pracował w Ambasadzie RP w Hanoi (w latach 2009–2010 jako chargé d'affaires a.i.). W latach 2015–2019 pełnił funkcję Konsula Generalnego RP w Ostrawie. Stanowisko w Tajpej objął w sierpniu 2025 r."
  },
  {
    "country": "Bośnia i Hercegowina",
    "city": "Sarajewo",
    "name": "Andrzej Jasionowski",
    "age": 59,
    "title": "Ambasador RP",
    "bio": "Absolwent prawa i kulturoznawstwa na Uniwersytecie Łódzkim oraz prawa na Uniwersytecie Warszawskim. Pracował w placówkach w Nigerii (1992–1994), Kazachstanie (1994–1997), Szwecji (1997–2000) i Finlandii (2002–2006). W MSZ pracował w Departamencie Polonii oraz Departamencie Konsularnym. Pełnił funkcję Ambasadora RP w Serbii (2009–2014) oraz w Chorwacji (2018–2023). Stanowisko w Sarajewie objął w grudniu 2023 r."
  },
  {
    "country": "Brazylia",
    "city": "Brasilia",
    "name": "Andrzej Cieszkowski",
    "age": 54,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent MGIMO oraz Szkoły Głównej Handlowej. Pracował w Ambasadzie RP w Portugalii (1998–2002). W centrali MSZ zatrudniony w Departamencie Unii Europejskiej oraz Departamencie Współpracy Międzynarodowej. Pełnił funkcję pełnomocnika Ministra Spraw Zagranicznych ds. Partnerstwa Wschodniego (2008–2013). W latach 2013–2016 Ambasador RP w Gruzji. Placówką w Brazylii kieruje od 2024 r."
  },
  {
    "country": "Bułgaria",
    "city": "Sofia",
    "name": "Anna Janiszewska-Frączek",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Zawodowy dyplomata. Była zastępca dyrektora Protokołu Dyplomatycznego."
  },
  {
    "country": "Chile",
    "city": "Santiago",
    "name": "Milena Łukasiewicz",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka Uniwersytetu Warszawskiego, Uniwersytetu Strasburskiego, Universidad Católica Andrés Bello w Caracas oraz Kolegium Europy. Pracowała w Ambasadzie Meksyku w Warszawie, Komisji Europejskiej (2008–2010) oraz Stałym Przedstawicielstwie RP przy UE. W latach 2012–2023 pracowała w Ambasadzie RP w Wenezueli (od 2017 jako chargé d'affaires). Placówką w Chile kieruje od sierpnia 2024 r."
  },
  {
    "country": "Chiny",
    "city": "Pekin",
    "name": "Jakub Radomir Kumoch",
    "age": 48,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Warszawskiego (stosunki międzynarodowe, orientalistyka), doktor nauk społecznych (Uniwersytet Jagielloński). Analityk Ośrodka Studiów Wschodnich i Polskiego Instytutu Spraw Międzynarodowych. Pełnił funkcję Ambasadora RP w Szwajcarii (2016–2020) oraz w Turcji (2020–2021). W latach 2021–2023 Szef Biura Polityki Międzynarodowej Kancelarii Prezydenta RP. Stanowisko w Pekinie objął w sierpniu 2023 r."
  },
  {
    "country": "Chorwacja",
    "city": "Zagrzeb",
    "name": "Paweł Czerwiński",
    "age": 58,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Jagiellońskiego. Pracował w ambasadach w Moskwie, Rydze, Lublanie, Ankarze (jako chargé d'affaires a.i.) oraz Belgradzie (jako chargé d'affaires a.i.). W MSZ m.in. zastępca dyrektora Sekretariatu Ministra (2013–2015). W latach 2015–2020 Ambasador RP w Słowenii. W latach 2020–2023 Doradca Prezydenta RP ds. polityki zagranicznej. Stanowisko w Chorwacji objął w listopadzie 2023 r."
  },
  {
    "country": "Cypr",
    "city": "Nikozja",
    "name": "Marek Szczepanowski",
    "age": 51,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Warszawskiego oraz Krajowej Szkoły Administracji Publicznej. Pracował w Konsulacie Generalnym RP w Mediolanie i Ambasadzie RP we Włoszech. Był zastępcą dyrektora Instytutu Polskiego w Rzymie. W latach 2021–2023 Dyrektor Protokołu Dyplomatycznego MSZ. Stanowisko na Cyprze objął we wrześniu 2023 r."
  },
  {
    "country": "Czarnogóra",
    "city": "Podgorica",
    "name": "Bartosz Marcinkowski",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent politologii na Uniwersytecie Jagiellońskim. Były redaktor czasopisma New Eastern Europe. Pracował w Ambasadzie RP w Chorwacji (2018–2022). Zastępca Dyrektora Akademii Dyplomatycznej (2022–2024), pracownik Departamentu Polityki Zewnętrznej UE (2024–2025). Placówką kieruje od września 2025 r."
  },
  {
    "country": "Czechy",
    "city": "Praga",
    "name": "Barbara Krystyna Tuge-Erecińska",
    "age": 69,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka skandynawistyki na Uniwersytecie Gdańskim. Pełniła funkcję Ambasadora RP w Szwecji (1991–1997), Danii (2001–2005), Wielkiej Brytanii (2006–2012) oraz na Cyprze (2014–2018). W latach 1999–2001 Podsekretarz Stanu, a w latach 2005–2006 Sekretarz Stanu w MSZ. Placówką w Czechach kieruje od kwietnia 2025 r."
  },
  {
    "country": "Dania",
    "city": "Kopenhaga",
    "name": "Ewa Dębska",
    "age": 57,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka skandynawistyki na Uniwersytecie im. Adama Mickiewicza w Poznaniu. Pracowała w ambasadach w Danii (1999–2003) i Szwecji (2008–2013). W centrali MSZ zatrudniona w departamentach ds. UE, Systemu Informacji oraz Współpracy Rozwojowej. W latach 2015–2017 pełniła funkcję Ambasadora RP na Łotwie. Placówką w Danii kieruje od października 2024 r."
  },
  {
    "country": "Egipt",
    "city": "Kair",
    "name": "Michał Murkociński",
    "age": 61,
    "title": "Ambasador RP",
    "bio": "Absolwent arabistyki na Uniwersytecie Jagiellońskim. Pracował w placówkach w Damaszku (1996–2001) i Bejrucie (2004–2006). Pełnił funkcję Ambasadora RP w Syrii (2008–2012), Egipcie (2014–2018) oraz Sudanie (2019–2024). Ponownie objął stanowisko w Egipcie w marcu 2025 r. (z akredytacją w Erytrei)."
  },
  {
    "country": "Estonia",
    "city": "Tallinn",
    "name": "Artur Orzechowski",
    "age": 58,
    "title": "Ambasador RP",
    "bio": "Absolwent romanistyki na UMCS w Lublinie oraz Krajowej Szkoły Administracji Publicznej. Pracował w Konsulacie Generalnym w Montrealu i Ambasadzie RP w Waszyngtonie. W MSZ pełnił funkcję dyrektora Departamentu Ameryki oraz Departamentu Polityki Europejskiej. W latach 2016–2021 Ambasador RP w Belgii. Stanowisko w Estonii objął w kwietniu 2025 r."
  },
  {
    "country": "Etiopia",
    "city": "Addis Abeba",
    "name": "Ilona Korchut",
    "age": 48,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka socjologii na Katolickim Uniwersytecie Lubelskim. Pracowała w MSZ w departamentach: Współpracy Rozwojowej, Afryki i Bliskiego Wschodu oraz Azji i Pacyfiku. Pełniła służbę w placówkach w Nigerii (2009–2011, 2018–2019), Tajlandii (2012–2017) oraz Singapurze (jako chargé d'affaires). Placówką w Etiopii kieruje od kwietnia 2025 r."
  },
  {
    "country": "Filipiny",
    "city": "Manila",
    "name": "Katarzyna Wilkowiecka",
    "age": 51,
    "title": "chargé d'affaires a.i.",
    "bio": "Dyplomatka, pracowała w Departamentu Azji i Pacyfiku MSZ."
  },
  {
    "country": "Finlandia",
    "city": "Helsinki",
    "name": "Tomasz Chłoń",
    "age": 63,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent filologii węgierskiej na Uniwersytecie Warszawskim. Pracował w Ambasadzie RP w Finlandii oraz Stałym Przedstawicielstwie przy NATO. Pełnił funkcję Ambasadora RP w Estonii (2005–2010) oraz na Słowacji (2013–2015). W MSZ m.in. Pełnomocnik ds. Przeciwdziałania Międzynarodowej Dezinformacji. Placówką w Finlandii kieruje od grudnia 2024 r."
  },
  {
    "country": "Francja",
    "city": "Paryż",
    "name": "Jan Emeryk Rościszewski",
    "age": 57,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Warszawskiego, KUL oraz Institut d'Études Politiques w Paryżu. Wieloletni menedżer w sektorze finansowym (m.in. AXA, BNP Paribas). W 2021 r. prezes zarządu PKO BP. Stanowisko w Paryżu objął w kwietniu 2022 r. (z akredytacją w Monako)."
  },
  {
    "country": "Grecja",
    "city": "Ateny",
    "name": "Wojciech Ponikiewski",
    "age": 61,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Akademii Ekonomicznej w Poznaniu oraz uczelni w Nancy i Louvain. Pracował w Stałym Przedstawicielstwie przy ONZ w Nowym Jorku oraz w Sekretariacie ONZ. W latach 2010–2015 pełnił funkcję Ambasadora RP we Włoszech. Placówką w Grecji kieruje od listopada 2024 r."
  },
  {
    "country": "Gruzja",
    "city": "Tbilisi",
    "name": "Artur Gębal",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Uniwersytetu Gdańskiego i Uniwersytetu Strasburskiego. Pracował w administracji rządowej oraz Europejskiej Służbie Działań Zewnętrznych (szef delegatury UE w Kijowie). Placówką w Gruzji kieruje od listopada 2024 r."
  },
  {
    "country": "Hiszpania",
    "city": "Madryt",
    "name": "Monika Krzepkowska",
    "age": 46,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka Uniwersytetu Warszawskiego i Uniwersytetu w Maastricht. W latach 2014–2017 dyrektor gabinetu Ministra Spraw Zagranicznych. W latach 2015–2017 dyrektor Instytutu Polskiego w Bratysławie. Placówką w Hiszpanii kieruje od października 2024 r."
  },
  {
    "country": "Holandia",
    "city": "Haga",
    "name": "Margareta Kassangana",
    "age": 48,
    "title": "Ambasador RP",
    "bio": "Absolwentka Uniwersytetu Warszawskiego i Uniwersytetu w Maastricht. Pracowała w MSZ, Komisji Europejskiej oraz Europejskiej Służbie Działań Zewnętrznych. W latach 2018–2022 pełniła funkcję Ambasadora RP w Senegalu. Stanowisko w Holandii objęła w styczniu 2023 r."
  },
  {
    "country": "Indie",
    "city": "New Delhi",
    "name": "Piotr Świtalski",
    "age": 67,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Uniwersytetu Warszawskiego i MGIMO. Były wiceminister spraw zagranicznych (2005) oraz Stały Przedstawiciel RP przy Radzie Europy (2005–2010). W latach 2015–2019 Ambasador UE w Armenii. Placówką w Indiach kieruje od stycznia 2025 r."
  },
  {
    "country": "Indonezja",
    "city": "Dżakarta",
    "name": "Barbara Szymanowska",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka Uniwersytetu Warszawskiego oraz Uniwersytetu Sussex. Pracowała w Ambasadzie RP w Afganistanie (2009–2010). W 2014 r. pełniła funkcję Ambasadora RP w Wietnamie. Placówką w Indonezji kieruje od marca 2025 r."
  },
  {
    "country": "Irak",
    "city": "Bagdad",
    "name": "Wojciech Bożek",
    "age": 64,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Akademii Ekonomicznej w Katowicach i MGIMO. Pracował w placówkach w ZEA i Syrii. Pełnił funkcję Ambasadora RP w Kuwejcie (2001–2005), Libii (2010–2012) i Libanie (2013–2017) oraz chargé d'affaires w Tanzanii (2007–2008). Placówką w Iraku kieruje od lutego 2025 r."
  },
  {
    "country": "Iran",
    "city": "Teheran",
    "name": "Marcin Wilczek",
    "age": 56,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Uniwersytetu Warszawskiego i KSAP. Pracował w Ambasadzie RP w Wielkiej Brytanii. Pełnił funkcję Konsula Generalnego w Stambule (2005–2008), Ambasadora RP w Turcji (2008–2012) oraz Ambasadora RP w Rumunii (2015–2019). Placówką w Iranie kieruje od października 2024 r."
  },
  {
    "country": "Irlandia",
    "city": "Dublin",
    "name": "Artur Michalski",
    "age": 62,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Akademii Teologii Katolickiej. Pracował w ambasadach w Moskwie i Waszyngtonie. Pełnił funkcję Ambasadora RP w Mołdawii (2012–2017) oraz na Białorusi (2018–2023). Placówką w Irlandii kieruje od października 2024 r."
  },
  {
    "country": "Islandia",
    "city": "Reykjavik",
    "name": "Aleksander Kropiwnicki",
    "age": 63,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent polonistyki na Uniwersytecie Warszawskim. W latach 2011–2014 pracował w Ambasadzie RP w Nairobi (czasowo jako chargé d'affaires). W latach 2017–2020 Ambasador RP w Etiopii."
  },
  {
    "country": "Izrael",
    "city": "Tel Awiw",
    "name": "Maciej Hunia",
    "age": 64,
    "title": "Ambasador RP",
    "bio": "Generał brygady wywiadu cywilnego. Szef Służby Wywiadu Wojskowego (2008) oraz szef Agencji Wywiadu (2008–2015). Wcześniej funkcjonariusz UOP i ABW."
  },
  {
    "country": "Japonia",
    "city": "Tokio",
    "name": "Paweł Milewski",
    "age": 44,
    "title": "Ambasador RP",
    "bio": "Absolwent UAM (sinologia), Uniwersytetu w Xiamen i SGH. Pracował w Ambasadzie RP w Chinach (2003–2009). W latach 2013–2017 Ambasador RP w Australii. Stanowisko w Japonii objął w 2019 r."
  },
  {
    "country": "Jordania",
    "city": "Amman",
    "name": "Karol Leśniak",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Wcześniej pełnił funkcję zastępcy ambasadora i radcy."
  },
  {
    "country": "Kanada",
    "city": "Ottawa",
    "name": "Witold Dzielski",
    "age": 45,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Jagiellońskiego, Uniwersytetu Warszawskiego i Uniwersytetu Notre Dame. Pracował w Ambasadzie RP w Waszyngtonie (2007–2012). W 2016 r. dyrektor Biura Polityki Międzynarodowej w Kancelarii Prezydenta RP. Stanowisko w Kanadzie objął w 2022 r."
  },
  {
    "country": "Katar",
    "city": "Doha",
    "name": "Tomasz Sadziński",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Warszawskiego i Uniwersytetu Oksfordzkiego. Pracował w placówkach przy NATO w Brukseli (2003–2004), w Kuwejcie (2005–2009) oraz w Dosze (konsul, zastępca szefa placówki 2018–2022). Nominacja w 2025 r."
  },
  {
    "country": "Kazachstan",
    "city": "Astana",
    "name": "Michał Łabenda",
    "age": 51,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Kazachskiego Narodowego Uniwersytetu (arabistyka) i doktor UW. Pracował w ambasadach w Japonii i Uzbekistanie. Pełnił funkcję Ambasadora RP w Azerbejdżanie (2010–2014), Mongolii (wizytujący, od 2015) oraz Egipcie (2018–2023). Placówką w Kazachstanie kieruje od września 2024 r."
  },
  {
    "country": "Kenia",
    "city": "Nairobi",
    "name": "Mirosław Gojdź",
    "age": 61,
    "title": "Ambasador RP",
    "bio": "Absolwent anglistyki w Częstochowie i politologii na Uniwersytecie Opolskim. Pracował w ambasadach w Atenach i Nikozji. Stanowisko objął w marcu 2023 r. (akredytowany również na Mauritiusie, Seszelach, Madagaskarze, w Ugandzie, Somalii oraz przy UNEP i UN-Habitat)."
  },
  {
    "country": "Kolumbia",
    "city": "Bogota",
    "name": "Barbara Sośnicka",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwentka orientalistyki na Uniwersytecie Warszawskim. Pracowała w ambasadach w Belgii, Peru, Hiszpanii (jako chargé d'affaires), Szwecji (konsul) oraz Francji (zastępca ambasadora). Stanowisko w Kolumbii objęła w kwietniu 2025 r."
  },
  {
    "country": "Korea Południowa",
    "city": "Seul",
    "name": "Bartosz Wiśniewski",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Były analityk PISM i visiting fellow w CSIS. Pracował jako dyrektor Instytutu Kultury Polskiej w Londynie."
  },
  {
    "country": "Kuba",
    "city": "Hawana",
    "name": "Joanna Kozińska-Frybes",
    "age": 64,
    "title": "Ambasador RP",
    "bio": "Absolwentka iberystyki na Uniwersytecie Warszawskim. Pełniła funkcję Ambasadora RP w Meksyku (1993–1999). Była Konsulem Generalnym w Barcelonie, Los Angeles i Lyonie. Stanowisko na Kubie objęła w 2023 r."
  },
  {
    "country": "Kuwejt",
    "city": "Kuwejt",
    "name": "Michał Cholewa",
    "age": 39,
    "title": "Ambasador RP",
    "bio": "Absolwent Uniwersytetu Jagiellońskiego. Pracował w ambasadach w Tel Awiwie i Paryżu oraz w centrali MSZ (Departament Afryki i Bliskiego Wschodu)."
  },
  {
    "country": "Liban",
    "city": "Bejrut",
    "name": "Aleksandra Bukowska-McCabe",
    "age": 47,
    "title": "Ambasador RP",
    "bio": "Absolwentka orientalistyki na Uniwersytecie Warszawskim. W latach 2014–2019 Przedstawicielka RP przy Palestyńskiej Władzy Narodowej. Wicedyrektor Departamentu Afryki i Bliskiego Wschodu MSZ (od 2023)."
  },
  {
    "country": "Libia",
    "city": "Trypolis",
    "name": "Grzegorz Olszak",
    "age": 54,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent arabistyki i stosunków międzynarodowych na Uniwersytecie Warszawskim. Kierownik Wydziału Politycznego w Kairze (2005–2009). W latach 2013–2017 Ambasador RP w Kuwejcie. Placówką w Libii kieruje od 2023 r."
  },
  {
    "country": "Litwa",
    "city": "Wilno",
    "name": "Grzegorz Poznański",
    "age": 54,
    "title": "chargé d'affaires a.i.",
    "bio": "W latach 2010–2014 Ambasador RP w Estonii. W latach 2020–2024 Dyrektor Generalny Stałego Sekretariatu Rady Państw Morza Bałtyckiego."
  },
  {
    "country": "Luksemburg",
    "city": "Luksemburg",
    "name": "Rafał Hykawy",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Były dyrektor Sekretariatu i zastępca dyrektora Biura Prezesa Rady Ministrów."
  },
  {
    "country": "Macedonia Północna",
    "city": "Skopje",
    "name": "Mariusz Brymora",
    "age": 65,
    "title": "chargé d'affaires a.i.",
    "bio": "Były wiceprezydent Radomia. W latach 2013–2017 Konsul Generalny RP w Los Angeles. Placówką kieruje od listopada 2024 r."
  },
  {
    "country": "Malezja",
    "city": "Kuala Lumpur",
    "name": "Krzysztof Dobrowolski",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwent filologii orientalnej na Uniwersytecie Jagiellońskim i KSAP. Zastępca ambasadora w Bangkoku (2004–2008) i Pekinie (2011–2015). Zastępca dyrektora Departamentu Azji i Pacyfiku MSZ (2015–2023). Stanowisko objął w maju 2023 r."
  },
  {
    "country": "Malta",
    "city": "Valletta",
    "name": "Małgorzata Kopeć",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Urzędniczka. Na stanowisku zastępcy dyrektora Biura Ministra blisko współpracowała z ministrem Zbigniewem Rauem, następnie na tym samym stanowisku zaufana ministra Radosława Sikorskiego."
  },
  {
    "country": "Maroko",
    "city": "Rabat",
    "name": "Tomasz Orłowski",
    "age": 68,
    "title": "chargé d'affaires a.i.",
    "bio": "Doktor nauk humanistycznych (Poitiers). W latach 2007–2014 Ambasador RP we Francji, w latach 2015–2017 Ambasador RP we Włoszech. Były dyrektor Protokołu Dyplomatycznego MSZ. Placówką w Maroku kieruje od stycznia 2025 r."
  },
  {
    "country": "Meksyk",
    "city": "Meksyk",
    "name": "Agnieszka Frydrychowicz-Tekieli",
    "age": 52,
    "title": "Ambasador RP",
    "bio": "Absolwentka politologii na Uniwersytecie Warszawskim. Pracowała w Stałym Przedstawicielstwie RP przy UE oraz Ambasadzie RP w Madrycie. W latach 2016–2020 Ambasador RP w Kolumbii. Stanowisko w Meksyku objęła w maju 2025 r."
  },
  {
    "country": "Mongolia",
    "city": "Ułan Bator",
    "name": "Krzysztof Świderek",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Doktor nauk technicznych. Konsul Generalny w Kijowie (2001–2003), Winnicy (2009–2015), Irkucku (2017–2025). Kierował wydziałem konsularnym w Mińsku (2005)."
  },
  {
    "country": "Mołdawia",
    "city": "Kiszyniów",
    "name": "Tomasz Kobzdej",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwent politologii na Uniwersytecie Warszawskim (doktorat). W latach 2010–2016 zastępca ambasadora w Tallinnie. Wicedyrektor Departamentu Azji i Pacyfiku MSZ (od 2019). Stanowisko objął w 2022 r."
  },
  {
    "country": "Niemcy",
    "city": "Berlin",
    "name": "Jan Tombiński",
    "age": 67,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent germanistyki na Uniwersytecie Jagiellońskim. Ambasador RP w Słowenii (1995–1998) i Francji (2001–2007). Stały Przedstawiciel RP przy UE (2007–2012). Ambasador UE w Kijowie i Rzymie (2012–2020). Placówką w Berlinie kieruje od sierpnia 2024 r."
  },
  {
    "country": "Nigeria",
    "city": "Abudża",
    "name": "Michał Cygan",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Dyplomata. Były dyrektor Departamentu Współpracy Rozwojowej MSZ."
  },
  {
    "country": "Norwegia",
    "city": "Oslo",
    "name": "Małgorzata Kosiura-Kaźmierska",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Była dyrektor Departamentu Wschodniego MSZ. Pracowała w Stałym Przedstawicielstwie przy UE oraz Ambasadzie RP w Waszyngtonie. Od 2024 r. kierowała placówką w Norwegii jako chargé d'affaires. Nominacja na ambasadora w kwietniu 2025 r."
  },
  {
    "country": "Nowa Zelandia",
    "city": "Wellington",
    "name": "Patryk Błaszczak",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwent lingwistyki na Uniwersytecie Warszawskim. Pracował w Ambasadzie RP we Francji i Kopenhadze. Dyrektor Departamentu Polityki Europejskiej MSZ (2022–2023). Stanowisko objął w kwietniu 2025 r."
  },
  {
    "country": "Pakistan",
    "city": "Islamabad",
    "name": "Maciej Pisarski",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Absolwent historii na Uniwersytecie Warszawskim. Zastępca szefa placówki w USA (2010–2016). Dyrektor Departamentu Strategii Polityki Zagranicznej (2018–2021). Stanowisko objął w 2021 r."
  },
  {
    "country": "Panama",
    "city": "Panama",
    "name": "Jolanta Janek",
    "age": 62,
    "title": "Ambasador RP",
    "bio": "Doktor nauk ekonomicznych. Pracowała w Ambasadzie RP w Rzymie. Ambasador wizytująca na Malcie (2014–2019). Stanowisko w Panamie objęła w lutym 2025 r."
  },
  {
    "country": "Peru",
    "city": "Lima",
    "name": "Anna Pieńkosz",
    "age": 48,
    "title": "Ambasador RP",
    "bio": "Absolwentka politologii na Uniwersytecie Śląskim i romanistyki na UMCS. Pracowała w Wenezueli (chargé d'affaires) i na Kubie (chargé d'affaires). W latach 2015–2020 Ambasador RP na Kubie. Stanowisko w Peru objęła w lipcu 2025 r."
  },
  {
    "country": "Portugalia",
    "city": "Lizbona",
    "name": "Dorota Barys",
    "age": 54,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka hispanistyki na Uniwersytecie im. Adama Mickiewicza. Konsul Generalna RP w Kurytybie (2007–2012), dyrektor Instytutu Polskiego w Madrycie (2014–2017). Placówką w Portugalii kieruje od 2024 r."
  },
  {
    "country": "Południowa Afryka",
    "city": "Pretoria",
    "name": "Jacek Chodorowicz",
    "age": 61,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent historii na Uniwersytecie Warszawskim. Chargé d'affaires w Zimbabwe (1995–1999). Ambasador RP w Syrii (2002–2008) i Izraelu (2012–2018). Placówką w RPA kieruje od stycznia 2025 r."
  },
  {
    "country": "Palestyna (Przedstawicielstwo)",
    "city": "Ramallah",
    "name": "Wiesław Kuceł",
    "age": 53,
    "title": "Minister pełnomocny",
    "bio": "Absolwent MGIMO. Pracował w placówkach w Tel Awiwie, Bejrucie i Kairze."
  },
  {
    "country": "Rosja",
    "city": "Moskwa",
    "name": "Krzysztof Krajewski",
    "age": 57,
    "title": "Ambasador RP",
    "bio": "Absolwent politologii na Uniwersytecie Warszawskim. Konsul Generalny w Warnie (1998–2003). Ambasador RP w Azerbejdżanie (2005–2010) i Bułgarii (2015–2018). Stanowisko w Moskwie objął w 2021 r."
  },
  {
    "country": "Rumunia",
    "city": "Bukareszt",
    "name": "Paweł Soloch",
    "age": 61,
    "title": "Ambasador RP",
    "bio": "Absolwent historii na Uniwersytecie Warszawskim. Szef Biura Bezpieczeństwa Narodowego (2015–2022). Doradca Prezydenta RP (od 2022). Stanowisko w Rumunii objął w 2023 r."
  },
  {
    "country": "Rwanda",
    "city": "Kigali",
    "name": "Grzegorz Piotr Morawski",
    "age": 53,
    "title": "Ambasador RP",
    "bio": "Konsul Generalny w Toronto (2012–2017) i Chengdu (2019–2023). Stanowisko w Rwandzie objął w lipcu 2025 r."
  },
  {
    "country": "Senegal",
    "city": "Dakar",
    "name": "Julita Bas",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwentka Krajowej Szkoły Administracji Publicznej i Uniwersytetu Warszawskiego. Placówką kieruje od grudnia 2024 r."
  },
  {
    "country": "Serbia",
    "city": "Belgrad",
    "name": "Anna Kostrzewa-Misztal",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Dyplomatka. Obecna dyrektor Departamentu Wschodniego."
  },
  {
    "country": "Singapur",
    "city": "Singapur",
    "name": "Tadeusz Jerzy Chomicki",
    "age": 62,
    "title": "Ambasador RP",
    "bio": "Socjolog. Ambasador RP w Korei Południowej (2001–2005) i Chinach (2009–2015). W Singapurze od 2024 r., początkowo jako chargé d'affaires."
  },
  {
    "country": "Stany Zjednoczone",
    "city": "Waszyngton",
    "name": "Bogdan Klich",
    "age": 65,
    "title": "chargé d'affaires a.i.",
    "bio": "Lekarz i politolog. Minister Obrony Narodowej (2007–2011). Senator (2011–2024). Placówką w USA kieruje od 2024 r."
  },
  {
    "country": "Słowacja",
    "city": "Bratysława",
    "name": "Piotr Samerek",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Dyplomata, w latach 2013–2019 zastępca ambasadora w Bratysławie."
  },
  {
    "country": "Słowenia",
    "city": "Lublana",
    "name": "Leszek Soczewica",
    "age": 65,
    "title": "chargé d'affaires a.i.",
    "bio": "Generał dywizji. Podsekretarz stanu w MSZ (2014–2015). Ambasador RP na Słowacji (2015–2018)."
  },
  {
    "country": "Szwajcaria",
    "city": "Berno",
    "name": "Marek Prawda",
    "age": 69,
    "title": "chargé d'affaires a.i.",
    "bio": "Ambasador Rzeczypospolitej Polskiej w Szwecji (2001–2005) i Niemczech (2006–2012), stały przedstawiciel RP przy Unii Europejskiej (2012–2016), dyrektor Przedstawicielstwa Komisji Europejskiej w Polsce (2016–2021), podsekretarz stanu w Ministerstwie Spraw Zagranicznych (2024–2025)."
  },
  {
    "country": "Szwecja",
    "city": "Sztokholm",
    "name": "Karolina Ostrzyniewska",
    "age": 50,
    "title": "Ambasador RP",
    "bio": "Urzędniczka. Stanowisko objęła w kwietniu 2025 r. (wcześniej chargé d'affaires a.i.)."
  },
  {
    "country": "Tajlandia",
    "city": "Bangkok",
    "name": "Konrad Pawlik",
    "age": 49,
    "title": "Zastępca dyrektora Departamentu Azji i Pacyfiku",
    "bio": "Wiceminister spraw zagranicznych (2014–2015). Ambasador RP na Białorusi (2016–2018)."
  },
  {
    "country": "Tanzania",
    "city": "Dodoma",
    "name": "Sergiusz Wolski",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "W MSZ od 2009 r., pracował w Londynie, Nairobi i ESDZ. Placówką kieruje od maja 2025 r. (z akredytacją na Malawi, Komory i Burundi)."
  },
  {
    "country": "Tunezja",
    "city": "Tunis",
    "name": "Justyna Porazińska",
    "age": null,
    "title": "Ambasador RP",
    "bio": "Arabistka. Pracowała w Damaszku, Kairze i Libii. Stanowisko objęła w lipcu 2022 r."
  },
  {
    "country": "Turcja",
    "city": "Ankara",
    "name": "Maciej Lang",
    "age": 57,
    "title": "Ambasador RP",
    "bio": "Doktor nauk humanistycznych. Były wiceminister spraw zagranicznych. Ambasador RP w Afganistanie, Kazachstanie i Rumunii. Stanowisko w Turcji objął w 2023 r."
  },
  {
    "country": "Ukraina",
    "city": "Kijów",
    "name": "Piotr Łukasiewicz",
    "age": 53,
    "title": "chargé d'affaires a.i.",
    "bio": "Pułkownik rezerwy, politolog. Ambasador RP w Afganistanie (2012–2014). Placówką na Ukrainie kieruje od 2024 r."
  },
  {
    "country": "Uzbekistan",
    "city": "Taszkent",
    "name": "Marian Przeździecki",
    "age": 57,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent prawa na KUL. Ambasador RP w Uzbekistanie w latach 2011–2015. Ponownie kieruje placówką od 2025 r."
  },
  {
    "country": "Watykan",
    "city": "Watykan",
    "name": "Adam Kwiatkowski",
    "age": 52,
    "title": "Ambasador RP",
    "bio": "Były szef gabinetu Prezydenta RP (2015–2017). Stanowisko objął w 2022 r."
  },
  {
    "country": "Wenezuela",
    "city": "Caracas",
    "name": "Daniel Gromann",
    "age": 52,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent iberystyki na Uniwersytecie Warszawskim. Konsul Generalny RP w Sydney (2009–2013). Placówką w Wenezueli kieruje od 2024 r."
  },
  {
    "country": "Wielka Brytania",
    "city": "Londyn",
    "name": "Jerzy Boczkowski",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Dyplomata, pisarz."
  },
  {
    "country": "Wietnam",
    "city": "Hanoi",
    "name": "Joanna Skoczek",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Konsul Generalna RP w Kantonie (2014–2018). Placówką w Wietnamie kieruje od 2024 r."
  },
  {
    "country": "Węgry",
    "city": "Budapeszt",
    "name": "Jacek Śladewski",
    "age": 62,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent filozofii na Uniwersytecie Warszawskim i KSAP. Pracował w Brukseli (NATO), Tallinnie, Sztokholmie i Moskwie. Placówką kieruje od lipca 2025 r."
  },
  {
    "country": "Włochy",
    "city": "Rzym",
    "name": "Ryszard Schnepf",
    "age": 74,
    "title": "chargé d'affaires a.i.",
    "bio": "Historyk. Były podsekretarz stanu w MSZ. Ambasador RP w Urugwaju, Hiszpanii i USA. Placówką we Włoszech kieruje od 2024 r. (z akredytacją w San Marino)."
  },
  {
    "country": "ZEA",
    "city": "Abu Zabi",
    "name": "Grzegorz Gawin",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Ekonomista. Pracował w Szwecji, Chorwacji i Katarze. Placówką w Abu Zabi kieruje od listopada 2024 r."
  },
  {
    "country": "Łotwa",
    "city": "Ryga",
    "name": "Tomasz Szeratics",
    "age": null,
    "title": "chargé d'affaires a.i.",
    "bio": "Absolwent Uniwersytetu Warszawskiego, SGH i Akademii Dyplomatycznej. Pracował w Zagrzebiu i Tallinnie. Placówką kieruje od lutego 2025 r."
  },
  {
    "country": "NATO (Bruksela)",
    "city": "Bruksela",
    "lat": 50.875,
    "lng": 4.41,
    "name": "Jacek Najder",
    "age": 65,
    "title": "Stały Przedstawiciel RP",
    "bio": "Ambasador RP w Afganistanie (2007–2008). Podsekretarz stanu w MSZ (2008–2011). Stały przedstawiciel RP przy NATO w latach 2011–2016 i ponownie od 2025 r."
  },
  {
    "country": "UE (Bruksela)",
    "city": "Bruksela",
    "lat": 50.842,
    "lng": 4.38,
    "name": "Agnieszka Bartol",
    "age": 53,
    "title": "Stały Przedstawiciel RP",
    "bio": "Urzędniczka unijna i państwowa. Sekretarz stanu w KPRM (2024). Stanowisko w Brukseli objęła w 2024 r."
  },
  {
    "country": "ONZ (Wiedeń)",
    "city": "Wiedeń",
    "lat": 48.23,
    "lng": 16.41,
    "name": "Marek Szczygieł",
    "age": 56,
    "title": "Kierownik Stałego Przedstawicielstwa (OBWE)",
    "bio": "Ambasador RP w Rumunii (2011–2015). Dyrektor Biura Wysokiego Komisarza OBWE ds. Mniejszości Narodowych (2023–2025). Stanowisko w Wiedniu objął w maju 2025 r."
  },
  {
    "country": "OECD (Paryż)",
    "city": "Paryż",
    "lat": 48.86,
    "lng": 2.27,
    "name": "Jacek Rostowski",
    "age": 74,
    "title": "Stały Przedstawiciel RP",
    "bio": "Ekonomista. Minister Finansów (2007–2013), wiceprezes Rady Ministrów (2013). Stanowisko objął w 2025 r."
  },
  {
    "country": "UNESCO (Paryż)",
    "city": "Paryż",
    "lat": 48.84,
    "lng": 2.30,
    "name": "Mariusz Lewicki",
    "age": null,
    "title": "Stały Przedstawiciel RP",
    "bio": "Absolwent Akademii Dyplomatycznej MSZ. Pracował w Stałych Przedstawicielstwach przy ONZ w Genewie i Nowym Jorku. Stanowisko objął w 2022 r."
  },
  {
    "country": "ONZ (Genewa)",
    "city": "Genewa",
    "name": "Mirosław Broiło",
    "age": null,
    "title": "Stały Przedstawiciel RP",
    "bio": "Dyplomata. Wcześniej pełnił funkcję chargé d'affaires a.i."
  },
  {
    "country": "ONZ (Nowy Jork)",
    "city": "Nowy Jork",
    "lat": 40.75,
    "lng": -73.96,
    "name": "Krzysztof Szczerski",
    "age": 52,
    "title": "Stały Przedstawiciel RP",
    "bio": "Politolog, profesor nauk społecznych. Podsekretarz stanu w MSZ (2007). Szef Gabinetu Prezydenta RP (2017–2021). Stanowisko w Nowym Jorku objął w 2021 r."
  },
  {
    "country": "Rada Europy (Strasburg)",
    "city": "Strasburg",
    "name": "Aleksander Pociej",
    "age": 60,
    "title": "chargé d'affaires a.i.",
    "bio": "Adwokat, były senator RP. Placówką kieruje od listopada 2024 r."
  },
  {
    "country": "ONZ (Rzym)",
    "city": "Rzym",
    "lat": 41.88,
    "lng": 12.48,
    "name": "Aleksander Iwanicki",
    "age": null,
    "title": "Stały Przedstawiciel RP",
    "bio": "Dyplomata. Były naczelnik w Departamencie Afryki i Bliskiego Wschodu."
  }
]
